adingoFluct ={};

window.addEventListener('load',start,false);

function start(){
	adingoFluct ={};
	var arg = new Object;
	var pair=location.search.substring(1).split('&');
		for(var i=0;pair[i];i++) {
   			 var kv = pair[i].split('=');
   			 arg[kv[0]]=kv[1];
		}
	if(arg['idol']){
		xxxjson(lulu2.call(new link(decodeURIComponent(arg['idol']))));
		chkidol(arg['idol']);
		adingoFluct ={};
	}else{
		xxxjson(lulu2.call(new link('女優')));
	}

	var j = document.getElementById("unitedblades_div");
	j.parentElement.removeChild(j);

 }

function chkidol(q){
	// console.log(q);
	var x = document.getElementsByClassName('idolname');
	for (var i = 0; i < x.length; i++){
		if(x[i].firstElementChild.title == decodeURIComponent(q)){
			x[i].style.backgroundColor = "plum";
		}
	}
}

function link(text){
    this.api_url = 'https://api.flickr.com/services/rest/?';
    this.opt = {method:'flickr.photos.search',
                api_key:'665f189ad2f511c7c9595aa9a845da03',
                text: encodeURIComponent(text),
                sort:'relevance',     // sort:'interestingness-desc',
                privacy_filter:'public+photos',
                content_type:'photos+only',
                per_page:'100',
                format:'json',
                nojsoncallback:'1',}
  }

function lulu2(){
        var url = '';
          for(var i in this.opt){
                url = url + i + '=' + this.opt[i] +'&';
          }
        return this.api_url+url;
  }

function imgurl(json_d){
		// console.log(json_d);
		// allids(json_d);
	    var xx = document.getElementById('list');
	    var oi = document.getElementsByClassName('flickr_img');
	          for(var l = oi.length; l > 0; l--){
	               xx.removeChild(oi[0]);
	            }
	    var t = json_d['photos']['photo'];
	    var size = '.jpg';    // var size = '_b.jpg';
	    for(var i in t){
	    	if(filter(t[i]['id'])){
		        var url = 'https://farm' + t[i]['farm'] + '.staticflickr.com/' + t[i]['server'] + '/' + t[i]['id'] + '_' + t[i]['secret'] + size;  
		        //console.info('imgurl::',url);
		        var b = document.createElement('div');
		            b.setAttribute('class','flickr_img');
		               for(var inf in t[i]){
		                    b.setAttribute(inf,t[i][inf]);
		                }
		            b.innerHTML = '<img src="'+ url +'" alt="' + t[i]['title'] +'" title="' + t[i]['title'] +'" />';
		            xx.appendChild(b);
		            document.title = t[i]['title'];
			}
	    }
	}

function xxxjson(ulink){
    var flickr_ajax = new XMLHttpRequest();
        flickr_ajax.onreadystatechange = function(){
          if(flickr_ajax.readyState == 4 && flickr_ajax.status == 200 ){
              imgurl(JSON.parse(flickr_ajax.responseText));
            }
          }
        flickr_ajax.open('GET', ulink, true);
        flickr_ajax.send(null);
  }

function filter(chkid){
	// フィルダです。存在するIDの画像は除外する。
	var ids = ["5969476017","2432678943","7168130457","2432678935","4590571603","8491888015","6122172275","2595933622","2600456839","2600469723","2595097287","1466959638","2601297994","2412789859","2410364765","2238661076","2664414976","2595098167","2424803949","1466957930","2595932204","1466108561","15493747059","16744277718","16309565794","16505511059","5997368693","8349638003","5430499865","5205663209","8513868889","16553238136","11820144864","3417107272","3417107096","3416299391","6937218772","4620695731","3810759942","258863572","15872915812","4587369999","2842679207","2842648029","4864960687","8059353950","8133917487","8059474763","9084689153","5412498516","9391332702","5937369994","2898392808","5478270613","5935731418","5004135586","6548901465","8577150577","1617687735","21968437014","16297187721","24143159976","2757878370","6313847465","8314524523","5936811991","515723885","2400542490","1558609498","5847157196","5835662613","15697875187","5718417984","8001574499","24308066175","7823018448","7878610724","5984289684","3015690845","8369907094","7856576694","16666698613","8032142456","2577370541","5490508659","7033566497","15382184122","2408471178","9523485054","9015628103","8447667325","8974010359","16831176473","14238191012","4010359","14818130783","14775586556","14611866647","8470144811","8391466323","14611858757","8161101217","14611958158","8318530530","8234120795","8517673515","8489650336","8471205666","8318536016","14611995487","8234049177","8426411663","3078873627","14611629119","8029710849","14798522785","14611627539","8191000828","10603578975","2944199844","14798588165","8317664885","2992065538","3684060686","8507558096","8488555251","8400444533","14795382901","8047490724","6044561753","8489653482","8471242210","8470112489","10838475654","8489650686","8404714227","8392514124","4039374800","8318448696","8043135492","8398912652","8234031753","8397835349","8426366863","8391500874","8317330053","8509145534","14611946458","8390416657","10838662443","10854852863","8488555211","8520420593","8488305199","8401494904","10600662154","8517694175","8398915690","8489400032","8392836973","8476470114","8520417439","8518806000","8491715497","8488349901","8427313996","8234098717","8475408445","8390298815","8398909238","8393925344","8518811816","8401538022","8437195117","8189929407","8517721555","8317323239","8517671671","8426341427","8391361406","8391307745","8430083314","8400379971","8471238396","8318525350","8381153433","8234985150","8234105451","8321051801","14604266549","14611752898","15049290481","8170950923","9521050061","8318457550","9525717418","14795371751","5949405729","7309455680","10601198656","8518788546","8390328925","9189526937","9588540109","9189534435","7309454188","8193425460","14810782093","9189526467","9189535727","9192334146","9189539891","8405808970","8391382858","9189538549","2143381140","8234082231","2143381154","3385222796","2143381148","2143381158","8042978716","7309454714","7309456140","7307950708","7343662428","7366124402","7457110456","7421435386","7324486668","7472915546","7178599403","7326354792","7324885596","7465107334","7407302806","7321235270","7343297050","7178684497","7318821512","7338126986","7363960162","7431989128","7320803082","7315565194","7403769394","7370589100","7157678285","7472833798","7322407950","7314769428","7395658972","7337108092","7420937704","7458716682","7335824060","7337874638","7178655445","7377684704","7371227760","7157559251","7387529942","7320949646","7323727750","7371404034","7367480874","7331777328","7337692804","7323092942","7391814126","7432106238","7403851198","7430350248","7431670066","7157223691","7332831822","7322862752","7498023500","7412466482","7321764672","7411706162","7484928500","7352659628","7184267127","7424390214","2904166509","4533768772","8437194135","14798127152","8170938049","8488555883","8170971016","8391465161","8235097828","14796034774","8317397929","8170972298","8233911429","4039214638","14794947771","5037758423","14818333323","14796031644","14611546887","14611929389","8517691515","10600673356","8476468934","8234941448","8322110428","11338924506","8318458316","8505964208","8426342621","8470232149","8047180458","8069215571","10854619314","8437516113","8502872989","8431999139","6806554353","6806554271","6806554577","9189524011","6806554417","10163796825","8032145472","8392392988","14787801021","25255229013","25934590675","8235165104","8573499621","15008951002","15119405510","15124292177","15125451917","15314788855","5220883120","15114726670","15132337967","9113699277","9918064953","8423660938","16353923729","11798787036","9165995236","11093129715","9398125574","10898041323","9398125972","3581294792","5047705460","2162797809","4333650086","5047467801","5602505296","2911319680","2910258642","3877033505","4539535525","2274937941","12980916564","15968020764"];

	if(ids.indexOf(chkid) == -1){
		// console.info('return true');
		return true;
	}else{
		// console.info('return false');
		return false;
	}
}

function fids(ids){
	// function filter(ids)の重複チェック
	// 単独利用
	var nids = [];
	console.info('old_array',ids.length);
	for(var i = 0 ; i < ids.length; i++){
		if(nids.indexOf(ids[i]) == -1){
			nids.push(ids[i]);
		}
	}
	
	var str = '';
	for(var i = 0; i < nids.length; i++){
		str = str +'"'+nids[i]+'",'
	}
	console.info('new_array',nids.length);
	console.info(str);
}


function allids(json_d){
	//JSON データのすべての写真IDをリターンする。フィルダをIDを集取するためのFNです。
	//単独利用
	vv = json_d["photos"]["photo"];
	ids = [];
		for(var i in vv){
			ids[i]=vv[i]['id'];
		}
	console.log(ids);
}


function at(){
	//すべてリンクのタイトルを取得します。
	//単独利用
	var x = document.getElementsByTagName('a');
	var t1;
	var t2
		for(var i=0; i < x.length; i++){
			t1 = t1 + x[i].title +',';
			t2 = t2 + '"' +x[i].title+ '",';

		}
	console.info(t1);
	console.info(t2);
}

function alla(){
	// あるページのすべてのリンクのInnerTextを集取し、リンクを作成
	// 単独利用
	// 本ベージにある全てのタイトルのをアレイを作成しておく
	var chk = ["岸明日香","壇蜜","森下悠里","今野杏南","辰巳奈都子","麻生久美子","橋本マナミ","逢沢りな","杉原杏璃","市川由衣","波多野結衣","木村佳乃","土岐麻梨子","佐々木心音","綾瀬はるか","ギャル曽根","樋口可南子","伊東美咲","愛あいり","尾崎ナナ","吉沢明歩","陳靜","中村静香","佐々木麻衣","成瀬心美","池田夏希","沖田杏梨","山地まり","深田恭子","吉木りさ","仁藤みさき","谷桃子","原幹恵","木嶋のりこ","浜田翔子","鎌田紘子","星名美津紀","小松彩夏","水樹たま","吉川あいみ","飯島愛","青山ひかる","小池里奈","秋山莉奈","鈴木咲","木口亜矢","磯山さやか","谷澤恵里香","小泉麻耶","涼本めぐみ","川村ゆきえ","桐山瑠衣","杉本有美","飯島直子","西田麻衣","愛川ゆず季","相武紗季","安枝瞳","相沢真紀","相川結","蒼井優","青木裕子","青田典子","青山倫子","秋山奈々","AKINA","浅田好未","足立梨花","あびる優","阿部美穂子","天海祐希","新垣結衣","荒井萌","有村架純","杏さゆり","安藤沙耶香","井川遥","池脇千鶴","石原さとみ","石井寛子","板野友美","一色紗英","いとうあいこ","井上和香","井上真央","井村空美","岩田さゆり","インリン・オブ・ジョイトイ","上戸彩","上野樹里","内田理央","榮倉奈々","江口ヒロミ","榎本加奈子","蛯原友里","小山田サユリ","及川奈央","大塚ちひろ","大沢あかね","大原かおり","大谷允保","大政絢","大島麻衣","大島優子","多田愛佳","大川藍","小川菜摘","奥菜恵","奥真奈美","奥山佳恵","押切もえ","尾島知佳","乙葉","小野真弓","小野恵令奈","柏木由紀","片瀬那奈","片山陽加","加藤あい","加藤夏希","加藤紀子","加藤ローサ","加藤沙耶香","金田美香","金子さやか","夏帆","香里奈","刈谷友衣子","川村亜紀","川本彩","河西智美","川栄李奈","菅野美穂","菊川怜","菊池桃子","菊地美香","菊地あやか","北川えり","北川景子","北川弘美","北乃きい","北原里英","吉瀬美智子","吉川友","木下優樹菜","木村多江","木村文乃","喜屋武ちあき","清久レイア","桐谷美玲","工藤里紗","国仲涼子","熊田曜子","くまきりあさ美","倉持明日香","栗山千明","黒川芽以","黒谷友香","黒木メイサ","黒川智花","見学奈緒","小池栄子","小泉今日子","小池里奈","国分佐智子","小嶋陽菜","小島瑠璃子","小橋めぐみ","小林麻央","小松千春","小松菜奈","小向美奈子","小雪","剛力彩芽","後藤藍","後藤郁","斉藤未知","斎藤友紀","斉藤慶子","酒井法子","酒井若菜","酒井瞳","桜井幸子","櫻井淳子","桜庭ななみ","指原莉乃","佐藤江梨子","さとう珠緒","佐藤めぐみ","佐藤仁美","里田まい","佐藤亜美菜","佐藤すみれ","佐藤唯","佐藤千亜妃","佐野ひなこ","沢尻エリカ","沢井美優","椎名法子","重盛さと美","志田未来","志田友美","篠原涼子","篠田麻里子","柴咲コウ","島崎和歌子","島崎遥香","釈由美子","白石美帆","白石みき","白鳥百合子","末永遥","杉本彩","杉野希妃","スザンヌ","鈴木杏","鈴木京香","鈴木まりや","鈴木紫帆里","瀬戸朝香","瀬戸早妃","瀬奈じゅん","芹那","千田愛紗","ソニン","平愛梨","平祐奈","高島礼子","高橋由美子","高岡早紀","高橋真唯","高部あい","高城亜樹","高橋みなみ","高木りな","高崎聖子","高梨臨","竹内結子","武田久美子","武井咲","竹富聖花","田代沙織","多田あさみ","橘ゆりか","田中麗奈","田中かおり","田中千絵","田名部生来","谷村美月","多部未華子","檀れい","近野莉菜","ちはる","辻希美","デヴィ・スカルノ","遠野凪子","常盤貴子","時東ぁみ","戸田恵梨香","外岡えりか","ともさかりえ","内藤陽子","中谷美紀","仲根かすみ","仲間由紀恵","中越典子","中島史恵","中川翔子","中澤裕子","仲里依紗","中村アン","仲川遥香","中田ちさと","仲谷明香","中塚智実","永作博美","長澤まさみ","長澤奈央","夏川純","夏目理緒","奈津子","夏菜","成海璃子","西田ひかる","西内まりや","西舘さをり","仁藤萌乃","根本はるみ","能年玲奈","野中美郷","野村佑香","野呂佳代","葉加瀬マイ","芳賀優里亜","橋本麗香","橋本楓","橋本愛","長谷川京子","長谷部優","八田亜矢子","葉月里緒奈","早見あかり","原田夏希","原田まりる","原史奈","東原亜希","比嘉愛未","雛形あきこ","日南響子","平山あや","平田裕香","平嶋夏海","広末涼子","広瀬アリス","ビビアン・スー","フィフィ","深津絵里","福田沙紀","福留佑子","福田麻衣","福田萌","藤原紀香","藤本綾","藤澤恵麻","藤江れいな","藤岡みなみ","辺見えみり","星野真里","ほしのあき","細川ふみえ","堀北真希","堀越のり","堀ちえみ","本上まなみ","前田愛","前田敦子","前田亜美","前川美奈","真木よう子","茉樹代","益子梨恵","増田有華","松たか子","松嶋菜々子","松本莉緒","松下奈緒","松雪泰子","松井絵里奈","松浦亜弥","松本若菜","松原渓","松木里菜","松井咲子","松井玲奈","松中みなみ","松本まりか","眞鍋かをり","間宮夕貴","三浦敦子","みさきゆう","水野裕子","水川あさみ","水沢エレナ","水原希子","水沢アリー","満島ひかり","南明奈","美奈子","峯岸みなみ","三原じゅん子","宮崎あおい","宮地真緒","宮澤佐江","宮崎美穂","三宅ひとみ","三好絵梨香","三吉彩花","森下千里","森カンナ","森田涼花","柳生みゆ","薬師丸ひろ子","矢口真里","安田美沙子","安めぐみ","矢田亜希子","矢部美穂","山口紗弥加","山咲千里","山口百恵","山田優","山本梓","山本彩乃","山下リオ","山内鈴蘭","山本舞香","山谷花純","優香","優木まおみ","夢眠ねむ","横山由依","横山ルリカ","吉野紗香","吉井怜","吉岡美穂","芳本美代子","吉田恵","吉本多香美","吉川ひなの","吉高由里子","吉見衣世","吉木りさ","米倉涼子","米沢瑠美","リア・ディゾン","理衣","六車奈々","ローラ・チャン","若槻千夏","和久井映見","渡辺美奈代","渡辺麻友","和田絵莉","アグネス・ラム","岡田奈々","大西結花","坂井泉水","田中美奈子","中森明菜","新田恵利","堀江しのぶ","松田聖子","安西ひろこ","牛川とこ","梅宮万紗子","黒田美礼","しいなまお","鈴木史華","そめやゆきこ","平田弥里","松田純","松田千奈","柳沼淳子","相澤仁美","安倍なつみ","飯田圭織","石坂ちなみ","伊藤えみ","江川有未","大久保麻理子","大城美和","AKB48","SDN48","小倉遥","折原みか","甲斐まり恵","海江田純子","海川ひとみ","神楽坂恵","華彩なな","柏木美里","和希沙也","木下あゆ美","小林恵美","佐々木梨絵","佐藤ゆりな","樹里","鈴木茜","すほうれいこ","瀬尾秋子","脊山麻理子","竹内のぞみ","田中涼子","田辺はるか","次原かな","手島優","中山恵","花井美理","福下恵美","福永ちな","堀田ゆい夏","三津谷葉子","森本さやか","矢吹春奈","鷲巣あやの","愛衣","赤井沙希","麻倉みな","亜里沙","安藤成子","石井めぐる","石川梨華","一双麻希","岩佐真悠子","上原美優","大矢真夕","尾形沙耶香","小田あさ美","大友さゆり","かでなれおん","鎌田奈津美","亀井絵里","川崎希","河中あい","桐村萌絵","倉科カナ","黒田有彩","小泉梓","小阪由佳","後藤真希","小林優美","小林ユリ","小町桃子","紺野あさ美","齊藤夢愛","桜木睦子","佐々木希","佐藤和沙","佐藤寛子","さとう里香","佐野夏芽","柴小聖","島本里沙","清水ゆう子","高橋愛","滝ありさ","滝川綾","多岐川華子","滝沢乃南","田代さやか","田中れいな","谷村奈南","戸田れい","永岡真実","中村果生莉","中村知世","長谷川恵美","秦みずほ","浜崎慶美","浜田コウ","疋田紗也","平野綾","広村美つ美","藤井梨花","藤本美貴","古崎瞳","北条佳奈","堀井美月","松嶋初音","松本さゆき","松山まみ","水崎綾女","道重さゆみ","三井麻由","八代みなせ","山口沙紀","山崎真実","山本早織","吉川綾乃","類家明日香","安藤遥","岩﨑名美","大野いと","岡田紗佳","岡本玲","奥仲麻琴","御伽ねこむ","おのののか","折山みゆ","川島海荷","木村葵","小池唯","紗綾","佐武宇綺","佐山彩香","篠崎愛","しほの涼","新川優愛","富樫あずさ","仲村みう","永井里菜","葉月あや","松山メアリ","水沢奈子","三原勇希","山田菜々","向井地美音","山本彩","渡辺美優紀","HKT48","京本有加","浦えりか","西野七瀬","白石麻衣","生田絵梨花","宮脇咲良","朝長美桜","兒玉遥","青山菜々","蒼井そら","麻美ゆま","佐山愛","灘坂舞","西條るり","女優"]; 
	var j = document.getElementsByTagName('a');
	for(var i in j){
		if(chk.indexOf(j[i].innerText) == -1){
			var name = j[i].innerText;
			console.log('<div class = "idolname level_1"><a href="./index.html?idol=' + name + '" title="' + name + '">' + name + '</a></div>');
		}
	}
}
